import pandas
KB={("зварювання", "перевага", "міцність з'єднання"),
      ("зварювання", "перевага", "широке застосування"),
      ("зварювання", "недолік", "висока температура процесу"),
      ("фрезерування", "перевага", "точність обробки"),
      ("фрезерування", "перевага", "можливість роботи з різними матеріалами"),
      ("фрезерування", "недолік", "складність налаштування обладнання"),
      ("лиття", "перевага", "можливість створення складних форм"),
      ("лиття", "недолік", "потреба в складних прес-формах"),
      ("штампування", "перевага", "висока продуктивність"),
      ("штампування", "недолік", "висока вартість обладнання"),
      ("порошкова металургія", "перевага", "економія матеріалу"),
      ("порошкова металургія", "недолік", "складність процесу виробництва")}
df = pandas.DataFrame(columns=["s","p","o"])
i=0
for s,p,o in KB:
    df.loc[i]={"s":s, "p":p, "o":o}
    i+=1
#df.to_csv('kb.csv', index=False)
df = pandas.read_csv('kb.csv')